In [84]:
#read from url 
import pandas as pd

url = "https://raw.githubusercontent.com/shionguha/inf1340-programmingfordatascience-fa22/main/data/titanic_dataset.csv"
df = pd.read_csv(url)
df

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500
2,0,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500
3,0,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500
4,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500
...,...,...,...,...,...,...,...,...,...
1304,0,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542
1305,0,3,"Zabour, Miss. Thamine",female,0.0000,1,0,2665,14.4542
1306,0,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250
1307,0,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250
1308,0,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750

**Review quiz question**  
You learned about lambda functions in last week’s tutorial session. Select the lambda that will ALWAYS raise an error. Note: some functions may or may not work depending on the input

In [12]:
lambda x: a+b

In [13]:
lambda y: y+90

In [14]:
lambda z: len(z)

In [15]:
lambda p, x, y: p%x+y

**The map() function executes a specified function for each item in an iterable.  
map(function, iterables)**

In [64]:
#using the map function 
def times(num):
    return num*2

result = map(times, [1,2,3,4])
list(result)

[2, 4, 6, 8]

In [6]:
#review lambda 
r = lambda a : a + 15
print(r(10))

r = lambda x, y : x * y
print(r(12, 4))

25
48

In [9]:
#combining map and lambda functions 
result1 = map(lambda a:a*2, [1,2,3,4])
print(list(result1))

[2, 4, 6, 8]

In [10]:
result2 = map(lambda a:a+15, [1,2,3,4])
list(result2)

[16, 17, 18, 19]

In [11]:
num1 = [1,2,3]
num2=[4,5,6]
print(list(map(lambda a, b: a+b, num1, num2)))

[5, 7, 9]

**Pandas indexing basics**

In [67]:
df.tail()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare
1304,0,3,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542
1305,0,3,"Zabour, Miss. Thamine",female,0.0,1,0,2665,14.4542
1306,0,3,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250
1307,0,3,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250
1308,0,3,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750

In [66]:
#currently the index is 0, 1, 2, 3, ... 
df.index

RangeIndex(start=0, stop=1309, step=1)

In [68]:
#change the index to the name column 
#we can check the name of the column 
print(df.columns)

Index(['survived', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare'],
      dtype='object')

In [80]:
#set the index to a column 
df2 = df.set_index("name", inplace=False)
df2.head()
df.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500
2,0,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500
3,0,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500
4,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500

In [89]:
#now we want to reset the index 
df.reset_index
df.head() #note this does not change the index of the df because inplace=False is the default setting

,,survived,pclass,sex,sibsp,parch,ticket,fare
name,age,,,,,,,
"Allen, Miss. Elisabeth Walton",29.0000,1,1,female,0,0,24160,211.3375
"Allison, Master. Hudson Trevor",0.9167,1,1,male,1,2,113781,151.5500
"Allison, Miss. Helen Loraine",2.0000,0,1,female,1,2,113781,151.5500
"Allison, Mr. Hudson Joshua Creighton",30.0000,0,1,male,1,2,113781,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0000,0,1,female,1,2,113781,151.5500

In [90]:
#to reset the index we can do either 
df1 = df.reset_index()
df1.head()

,name,age,survived,pclass,sex,sibsp,parch,ticket,fare
0,"Allen, Miss. Elisabeth Walton",29.0000,1,1,female,0,0,24160,211.3375
1,"Allison, Master. Hudson Trevor",0.9167,1,1,male,1,2,113781,151.5500
2,"Allison, Miss. Helen Loraine",2.0000,0,1,female,1,2,113781,151.5500
3,"Allison, Mr. Hudson Joshua Creighton",30.0000,0,1,male,1,2,113781,151.5500
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0000,0,1,female,1,2,113781,151.5500

In [91]:
#or we can reset the index in place 
df.reset_index(inplace=True)
df.head()

,name,age,survived,pclass,sex,sibsp,parch,ticket,fare
0,"Allen, Miss. Elisabeth Walton",29.0000,1,1,female,0,0,24160,211.3375
1,"Allison, Master. Hudson Trevor",0.9167,1,1,male,1,2,113781,151.5500
2,"Allison, Miss. Helen Loraine",2.0000,0,1,female,1,2,113781,151.5500
3,"Allison, Mr. Hudson Joshua Creighton",30.0000,0,1,male,1,2,113781,151.5500
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",25.0000,0,1,female,1,2,113781,151.5500

**Some other useful pandas dataframe functions you can use for data exploration and cleaning**

In [94]:
df.head(3)

,name,age,survived,pclass,sex,sibsp,parch,ticket,fare
0,"Allen, Miss. Elisabeth Walton",29.0000,1,1,female,0,0,24160,211.3375
1,"Allison, Master. Hudson Trevor",0.9167,1,1,male,1,2,113781,151.5500
2,"Allison, Miss. Helen Loraine",2.0000,0,1,female,1,2,113781,151.5500

In [28]:
df['name'].unique()

array(['Allen, Miss. Elisabeth Walton', 'Allison, Master. Hudson Trevor',
       'Allison, Miss. Helen Loraine', ..., 'Zakarian, Mr. Mapriededer',
       'Zakarian, Mr. Ortin', 'Zimmerman, Mr. Leo'], dtype=object)

In [29]:
df['sex'].unique()

array(['female', 'male'], dtype=object)

In [30]:
df['age'].max()

80.0

In [31]:
df['age'].min()

0.0

In [32]:
df['age'].mean()

23.877514667685258

In [33]:
df['age'].median()

24.0

In [34]:
df['age'].nsmallest(3)

15    0.0
37    0.0
40    0.0
Name: age, dtype: float64

In [35]:
df['age'].nlargest(3)

14      80.0
61      76.0
1235    74.0
Name: age, dtype: float64

**Sometimes you need to change the datatype of a dataframe column**

In [95]:
#first check the dtypes of the dataframe column 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      1309 non-null   object
 1   age       1309 non-null   float64
 2   survived  1309 non-null   int64
 3   pclass    1309 non-null   int64
 4   sex       1309 non-null   object
 5   sibsp     1309 non-null   int64
 6   parch     1309 non-null   int64
 7   ticket    1309 non-null   object
 8   fare      1309 non-null   float64
dtypes: float64(2), int64(4), object(3)
memory usage: 92.2+ KB

In [96]:
df.dtypes

name         object
age         float64
survived      int64
pclass        int64
sex          object
sibsp         int64
parch         int64
ticket       object
fare        float64
dtype: object

In [98]:
#say you want to change the ticket column into a categorical 
df.astype({'parch': 'category'}).dtypes

name          object
age          float64
survived       int64
pclass         int64
sex           object
sibsp          int64
parch       category
ticket        object
fare         float64
dtype: object

In [44]:
df['parch']=df['parch'].astype('int')
df.dtypes

name         object
survived      int64
pclass        int64
sex          object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
dtype: object

In [51]:
df.astype({'parch': 'category', 'age': 'category'}).dtypes

name          object
survived       int64
pclass         int64
sex           object
age         category
sibsp          int64
parch       category
ticket        object
fare         float64
dtype: object

Categoricals are a pandas data type corresponding to categorical variables in statistics. A categorical variable takes on a limited, and usually fixed, number of possible values (categories; levels in R). Examples are gender, social class, blood type, country affiliation, observation time or rating via Likert scales.

In contrast to statistical categorical variables, categorical data might have an order (e.g. ‘strongly agree’ vs ‘agree’ or ‘first observation’ vs. ‘second observation’), but numerical operations (additions, divisions, …) are not possible.

"source https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html"